Insert

In [1]:
import pandas as pd
a={"a":[1,2,3,4],"b":[1,2,13,4]}
var1=pd.DataFrame(a)
print(var1)

   a   b
0  1   1
1  2   2
2  3  13
3  4   4

In [2]:
#syntax:var1.insert(index number,colomn name,values/data)
var1.insert(1,"insert_column1",var1["a"])

In [3]:
var1

   a  insert_column1   b
0  1               1   1
1  2               2   2
2  3               3  13
3  4               4   4

In [4]:
var1.insert(3,"insert_column2",[12,21,23,14])
var1

   a  insert_column1   b  insert_column2
0  1               1   1              12
1  2               2   2              21
2  3               3  13              23
3  4               4   4              14

In [8]:
#copy limited data 
f={"A":[1,2,3,4],"B":[1,2,13,4]}
var1=pd.DataFrame(f)
var1["C"]=var1["A"][:2]
print(var1)

   A   B    C
0  1   1  1.0
1  2   2  2.0
2  3  13  NaN
3  4   4  NaN

Delete

In [9]:
f={"A":[1,2,3,4],"B":[1,2,13,4],"C":[1,3,2,4]}
var1=pd.DataFrame(f)
var2=var1.pop("B")
print(var2)

0     1
1     2
2    13
3     4
Name: B, dtype: int64

In [10]:
print(var1)

   A  C
0  1  1
1  2  3
2  3  2
3  4  4